{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CommonName-bio",
    "1": "B-Compound-bio",
    "2": "B-Location-bio",
    "3": "B-Process-bio",
    "4": "B-Species-bio",
    "5": "I-CommonName-bio",
    "6": "I-Compound-bio",
    "7": "I-Location-bio",
    "8": "I-Process-bio",
    "9": "I-Species-bio",
    "10": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CommonName-bio": 0,
    "B-Compound-bio": 1,
    "B-Location-bio": 2,
    "B-Process-bio": 3,
    "B-Species-bio": 4,
    "I-CommonName-bio": 5,
    "I-Compound-bio": 6,
    "I-Location-bio": 7,
    "I-Process-bio": 8,
    "I-Species-bio": 9,
    "O": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 28996
}
